trezor/trezor-firmware/core/embed/io/ble/stm32/ble.c
/*
 * This file is part of the Trezor project, https://trezor.io/
 *
 * Copyright (c) SatoshiLabs
 *
 * This program is free software: you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <http://www.gnu.org/licenses/>.
 */

#ifdef KERNEL_MODE
#include <stdint.h>
#include <string.h>

#include <trezor_bsp.h>
#include <trezor_model.h>
#include <trezor_rtl.h>

#include <io/ble.h>
#include <io/nrf.h>
#include <sys/irq.h>
#include <sys/sysevent_source.h>
#include <sys/systick.h>
#include <sys/systimer.h>
#include <util/tsqueue.h>
#include <util/unit_properties.h>

#ifdef USE_POWER_MANAGER
#include <sys/power_manager.h>
#endif

#include "ble_comm_defs.h"

static bool ble_start_pairing(ble_command_t *command);

// changing value of TX_QUEUE_LEN is not allowed
// as it might result in order of messages being changed
#define TX_QUEUE_LEN 1
#define EVENT_QUEUE_LEN 4
#define RX_QUEUE_LEN 16
#define LOOP_PERIOD_MS 20
#define PING_PERIOD 100

#define BLE_DATA_HEADER_SIZE 7
#define BLE_DATA_SIZE (BLE_RX_PACKET_SIZE + BLE_DATA_HEADER_SIZE)

enum bt_bas_bls_battery_present {
  BT_BAS_BLS_BATTERY_NOT_PRESENT = 0,
  BT_BAS_BLS_BATTERY_PRESENT = 1
};

enum bt_bas_bls_wired_power_source {
  BT_BAS_BLS_WIRED_POWER_NOT_CONNECTED = 0,
  BT_BAS_BLS_WIRED_POWER_CONNECTED = 1,
  BT_BAS_BLS_WIRED_POWER_UNKNOWN = 2
};

enum bt_bas_bls_wireless_power_source {
  BT_BAS_BLS_WIRELESS_POWER_NOT_CONNECTED = 0,
  BT_BAS_BLS_WIRELESS_POWER_CONNECTED = 1,
  BT_BAS_BLS_WIRELESS_POWER_UNKNOWN = 2
};

enum bt_bas_bls_battery_charge_state {
  BT_BAS_BLS_CHARGE_STATE_UNKNOWN = 0,
  BT_BAS_BLS_CHARGE_STATE_CHARGING = 1,
  BT_BAS_BLS_CHARGE_STATE_DISCHARGING_ACTIVE = 2,
  BT_BAS_BLS_CHARGE_STATE_DISCHARGING_INACTIVE = 3
};

enum bt_bas_bls_battery_charge_level {
  BT_BAS_BLS_CHARGE_LEVEL_UNKNOWN = 0,
  BT_BAS_BLS_CHARGE_LEVEL_GOOD = 1,
  BT_BAS_BLS_CHARGE_LEVEL_LOW = 2,
  BT_BAS_BLS_CHARGE_LEVEL_CRITICAL = 3
};

enum bt_bas_bls_battery_charge_type {
  BT_BAS_BLS_CHARGE_TYPE_UNKNOWN = 0,
  BT_BAS_BLS_CHARGE_TYPE_CONSTANT_CURRENT = 1,
  BT_BAS_BLS_CHARGE_TYPE_CONSTANT_VOLTAGE = 2,
  BT_BAS_BLS_CHARGE_TYPE_TRICKLE = 3,
  BT_BAS_BLS_CHARGE_TYPE_FLOAT = 4
};

enum bt_bas_bls_charging_fault_reason {
  BT_BAS_BLS_FAULT_REASON_NONE = 0,
  BT_BAS_BLS_FAULT_REASON_BATTERY = 1,
  BT_BAS_BLS_FAULT_REASON_EXTERNAL_POWER = 2,
  BT_BAS_BLS_FAULT_REASON_OTHER = 4
};

typedef struct {
  ble_mode_t mode_requested;
  ble_mode_t mode_current;
  bool connected;
  bt_le_addr_t connected_addr;
  uint8_t peer_count;
  bool initialized;
  bool status_valid;
  bool accept_msgs;
  bool reboot_on_resume;
  bool restart_adv_on_disconnect;
  bool next_adv_with_disconnect;  // next advertising will be started with
                                  // forced disconnect flag
  uint8_t busy_flag;
  bool pairing_allowed;
  bool pairing_requested;
  ble_event_t event_queue_buffers[EVENT_QUEUE_LEN];
  tsqueue_entry_t event_queue_entries[EVENT_QUEUE_LEN];
  tsqueue_t event_queue;

  uint8_t rx_queue_buffers[RX_QUEUE_LEN][BLE_DATA_SIZE];
  tsqueue_entry_t rx_queue_entries[RX_QUEUE_LEN];
  tsqueue_t rx_queue;

  uint8_t tx_queue_buffers[TX_QUEUE_LEN][BLE_DATA_SIZE];
  tsqueue_entry_t ts_queue_entries[TX_QUEUE_LEN];
  tsqueue_t tx_queue;

  ble_adv_start_cmd_data_t adv_cmd;
  bt_le_addr_t mac;
  bool mac_ready;
  bool high_speed;
  ble_tx_power_level_t power_level;

  uint8_t bond_count;
  bt_le_addr_t bonds[BLE_MAX_BONDS];
  bool bonds_ready;

  bool result;
  bool result_ready;

  systimer_t *timer;
  uint16_t ping_cntr;

#ifdef USE_POWER_MANAGER
  cmd_update_battery_t battery_state;
  bool battery_update_sent;
#endif

} ble_driver_t;

static ble_driver_t g_ble_driver = {0};

static const syshandle_vmt_t ble_handle_vmt;
static const syshandle_vmt_t ble_iface_handle_vmt;

static void ble_pairing_end(ble_driver_t *drv) {
  drv->pairing_allowed = false;
  drv->pairing_requested = false;
  drv->mode_requested = BLE_MODE_KEEP_CONNECTION;
}

static bool ble_send_state_request(ble_driver_t *drv) {
  (void)drv;
  uint8_t cmd = INTERNAL_CMD_SEND_STATE;
  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, &cmd, sizeof(cmd), NULL, NULL) >=
         0;
}

static bool ble_send_advertising_on(ble_driver_t *drv, bool whitelist) {
  (void)drv;

  unit_properties_t props;
  unit_properties_get(&props);

  cmd_advertising_on_t data = {
      .cmd_id = INTERNAL_CMD_ADVERTISING_ON,
      .flags.whitelist = whitelist ? 1 : 0,
      .flags.user_disconnect = drv->next_adv_with_disconnect ? 1 : 0,
      .flags.reserved = 0,
      .color = props.color,
      .static_addr = drv->adv_cmd.static_mac,
      .device_code = MODEL_BLE_CODE,
  };

  drv->next_adv_with_disconnect = false;

  memcpy(data.name, drv->adv_cmd.name, BLE_ADV_NAME_LEN);

  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, (uint8_t *)&data, sizeof(data),
                      NULL, NULL) >= 0;
}

static bool ble_send_speed_request(ble_driver_t *drv, bool high_speed) {
  (void)drv;
  uint8_t cmd =
      high_speed ? INTERNAL_CMD_SET_SPEED_HIGH : INTERNAL_CMD_SET_SPEED_LOW;
  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, &cmd, sizeof(cmd), NULL, NULL) >=
         0;
}

static bool ble_send_power_level_request(ble_driver_t *drv,
                                         ble_tx_power_level_t power_level) {
  (void)drv;
  uint8_t cmd[2] = {INTERNAL_CMD_SET_TX_POWER, (uint8_t)power_level};
  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, cmd, sizeof(cmd), NULL, NULL) >=
         0;
}

static bool ble_send_advertising_off(ble_driver_t *drv) {
  (void)drv;
  uint8_t cmd = INTERNAL_CMD_ADVERTISING_OFF;
  return nrf_send_msg(NRF_SERVICE_BLE_MANAGER, &cmd, sizeof(cmd), NULL, NULL) >=
         0;
}

