trezor/trezor-firmware/core/embed/io/ble/stm32/ble.c
  // in case connection speed differs from request, send a command
  if (msg.flags.high_speed != drv->high_speed) {
    ble_send_speed_request(drv, drv->high_speed);
  }

  // in case power level differs from request, send a command
  if ((ble_tx_power_level_t)msg.power_level != drv->power_level) {
    ble_send_power_level_request(drv, drv->power_level);
  }

  drv->status_valid = true;
}

static void ble_process_rx_msg_pairing_request(const uint8_t *data,
                                               uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  if (len < 7) {
    // insufficient data length
    return;
  }

  if (drv->pairing_allowed == false) {
    ble_send_pairing_reject(drv);
    return;
  }

  ble_event_t event = {.type = BLE_PAIRING_REQUEST,
                       .data_len = BLE_PAIRING_CODE_LEN};
  memcpy(event.data, &data[1], BLE_PAIRING_CODE_LEN);
  if (!tsqueue_enqueue(&drv->event_queue, (uint8_t *)&event, sizeof(event),
                       NULL)) {
    ble_send_pairing_reject(drv);
  } else {
    drv->pairing_requested = true;
  }
}

static void ble_process_rx_msg_pairing_cancelled(const uint8_t *data,
                                                 uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  ble_event_t event = {.type = BLE_PAIRING_CANCELLED, .data_len = 0};
  tsqueue_enqueue(&drv->event_queue, (uint8_t *)&event, sizeof(event), NULL);
  ble_pairing_end(drv);
}

static void ble_process_rx_msg_pairing_completed(const uint8_t *data,
                                                 uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  ble_event_t event = {.type = BLE_PAIRING_COMPLETED, .data_len = 0};
  tsqueue_enqueue(&drv->event_queue, (uint8_t *)&event, sizeof(event), NULL);
  drv->pairing_allowed = false;
  drv->pairing_requested = false;
  drv->peer_count += 1;
}

static void ble_process_rx_msg_mac(const uint8_t *data, uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  drv->mac_ready = true;
  drv->mac.type = 0;
  memcpy(&drv->mac.addr, &data[1], sizeof(drv->mac.addr));
}

static void ble_process_rx_msg_bond_list(const uint8_t *data, uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;
  if (!drv->initialized) {
    return;
  }

  if (len < 2) {
    return;
  }

  drv->bonds_ready = true;
  drv->bond_count = data[1];
  memcpy(&drv->bonds, &data[2], MIN(len - 2, sizeof(drv->bonds)));
}

static void ble_process_rx_msg(const uint8_t *data, uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;

  if (len < 1) {
    return;
  }

  switch (data[0]) {
    case INTERNAL_EVENT_STATUS:
      ble_process_rx_msg_status(data, len);
      break;
    case INTERNAL_EVENT_PAIRING_REQUEST:
      ble_process_rx_msg_pairing_request(data, len);
      break;
    case INTERNAL_EVENT_PAIRING_CANCELLED:
      ble_process_rx_msg_pairing_cancelled(data, len);
      break;
    case INTERNAL_EVENT_MAC:
      ble_process_rx_msg_mac(data, len);
      break;
    case INTERNAL_EVENT_PAIRING_COMPLETED:
      ble_process_rx_msg_pairing_completed(data, len);
      break;
    case INTERNAL_EVENT_BOND_LIST:
      ble_process_rx_msg_bond_list(data, len);
      break;
    case INTERNAL_EVENT_SUCCESS:
      drv->result_ready = true;
      drv->result = true;
      break;
    case INTERNAL_EVENT_FAILURE:
      drv->result_ready = true;
      drv->result = false;
      break;
    case INTERNAL_EVENT_BATTERY_STATE_REQUEST:
      drv->battery_update_sent = false;
      break;
    default:
      break;
  }
}

static bool ble_connected_add_match(ble_driver_t *drv, const uint8_t *addr) {
  return (addr[0] == drv->connected_addr.type &&
          memcmp(&addr[1], drv->connected_addr.addr,
                 sizeof(drv->connected_addr.addr)) == 0);
}

static void ble_process_data(const uint8_t *data, uint32_t len) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return;
  }

  if (!drv->accept_msgs) {
    return;
  }

  if (len != BLE_DATA_SIZE) {
    return;
  }

  if (!ble_connected_add_match(drv, data)) {
    // inconsistent address of a connected device

    drv->connected_addr.type = data[0];
    memcpy(drv->connected_addr.addr, &data[1],
           sizeof(drv->connected_addr.addr));

    ble_event_t event = {.type = BLE_CONNECTION_CHANGED};
    memcpy(event.data, drv->connected_addr.addr,
           sizeof(drv->connected_addr.addr));
    tsqueue_enqueue(&drv->event_queue, (uint8_t *)&event, sizeof(event), NULL);
  }

  tsqueue_enqueue(&drv->rx_queue, data, len, NULL);
}

// background loop, called from systimer every LOOP_PERIOD_MS
static void ble_loop(void *context) {
  ble_driver_t *drv = (ble_driver_t *)context;

  if (!drv->initialized) {
    return;
  }

  if (nrf_is_running()) {
    if (drv->ping_cntr == 0) {
      ble_send_state_request(drv);
    }

    drv->ping_cntr++;
    if (drv->ping_cntr >= PING_PERIOD / LOOP_PERIOD_MS) {
      drv->ping_cntr = 0;
    }

    uint8_t data[BLE_DATA_SIZE] = {0};
    if (tsqueue_dequeue(&drv->tx_queue, data, BLE_DATA_SIZE, NULL, NULL)) {
      if (!nrf_send_msg(NRF_SERVICE_BLE, data, BLE_DATA_SIZE, NULL, NULL)) {
        tsqueue_enqueue(&drv->tx_queue, data, BLE_DATA_SIZE, NULL);
      }
    }

    if (drv->accept_msgs && drv->busy_flag != 0) {
      cmd_set_busy_t cmd = {
          .cmd_id = INTERNAL_CMD_SET_BUSY,
          .flag = 0,
      };
      nrf_send_msg(NRF_SERVICE_BLE_MANAGER, (uint8_t *)&cmd, sizeof(cmd), NULL,
                   NULL);
    }

    if (!drv->accept_msgs && drv->busy_flag == 0) {
      cmd_set_busy_t cmd = {
          .cmd_id = INTERNAL_CMD_SET_BUSY,
          .flag = 1,
      };
      nrf_send_msg(NRF_SERVICE_BLE_MANAGER, (uint8_t *)&cmd, sizeof(cmd), NULL,
                   NULL);
    }

    if (drv->mode_current != drv->mode_requested) {
      if (drv->mode_requested == BLE_MODE_OFF) {
        ble_send_advertising_off(drv);
        if (drv->connected) {
          ble_send_disconnect(drv);
        }
      } else if (drv->mode_requested == BLE_MODE_KEEP_CONNECTION) {
        ble_send_advertising_off(drv);
      } else if (drv->mode_requested == BLE_MODE_CONNECTABLE) {
        ble_send_advertising_on(drv, true);
      } else if (drv->mode_requested == BLE_MODE_PAIRING) {
        ble_send_advertising_on(drv, false);
      }
    }

#ifdef USE_POWER_MANAGER
    pm_state_t state = {0};
    if (PM_OK == pm_get_state(&state)) {
      cmd_update_battery_t battery_state = {
          .cmd_id = INTERNAL_CMD_BATTERY_UPDATE,
          .battery_level = state.soc,
          .battery_present = BT_BAS_BLS_BATTERY_PRESENT,
          .charge_level = BT_BAS_BLS_CHARGE_LEVEL_UNKNOWN,
          .charge_type = BT_BAS_BLS_CHARGE_TYPE_UNKNOWN,
          .fault_reason = BT_BAS_BLS_FAULT_REASON_NONE,
      };

      if (state.wireless_connected) {
        battery_state.wireless_source_state =
            BT_BAS_BLS_WIRELESS_POWER_CONNECTED;
      } else {
        battery_state.wireless_source_state =
            BT_BAS_BLS_WIRELESS_POWER_NOT_CONNECTED;
      }

      if (state.usb_connected) {
        battery_state.wired_source_state = BT_BAS_BLS_WIRED_POWER_CONNECTED;
      } else {
        battery_state.wired_source_state = BT_BAS_BLS_WIRED_POWER_NOT_CONNECTED;
      }

