trezor/trezor-firmware/core/embed/io/ble/stm32/ble.c
  uint8_t tx_buf[BLE_DATA_SIZE];
  tx_buf[0] = drv->connected_addr.type;
  memcpy(&tx_buf[1], drv->connected_addr.addr,
         sizeof(drv->connected_addr.addr));
  memcpy(&tx_buf[BLE_DATA_HEADER_SIZE], data,
         MIN(len, BLE_DATA_SIZE - BLE_DATA_HEADER_SIZE));

  bool sent = nrf_send_msg(NRF_SERVICE_BLE, tx_buf, len + BLE_DATA_HEADER_SIZE,
                           NULL, NULL);

  if (!sent) {
    bool queued = tsqueue_enqueue(&drv->tx_queue, tx_buf,
                                  len + BLE_DATA_HEADER_SIZE, NULL);
    irq_unlock(key);
    return queued;
  }

  irq_unlock(key);
  return true;
}

bool ble_can_read(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  bool result = !tsqueue_empty(&drv->rx_queue);

  irq_unlock(key);

  return result;
}

uint32_t ble_read(uint8_t *data, uint16_t max_len) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return 0;
  }

  irq_key_t key = irq_lock();

  tsqueue_t *queue = &drv->rx_queue;

  uint16_t read_len = 0;

  uint8_t rx_data[BLE_DATA_SIZE];

  tsqueue_dequeue(queue, rx_data, sizeof(rx_data), &read_len, NULL);

  if (read_len != BLE_DATA_SIZE ||
      max_len < (read_len - BLE_DATA_HEADER_SIZE)) {
    irq_unlock(key);
    return 0;
  }

  // first 7 bytes is MAC, ignore for now
  memcpy(data, &rx_data[BLE_DATA_HEADER_SIZE], BLE_RX_PACKET_SIZE);

  irq_unlock(key);

  return BLE_RX_PACKET_SIZE;
}

bool ble_issue_command(ble_command_t *command) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  bool result = false;

  switch (command->cmd_type) {
    case BLE_SWITCH_OFF:
      drv->restart_adv_on_disconnect = false;
      drv->mode_requested = BLE_MODE_OFF;
      result = true;
      break;
    case BLE_SWITCH_ON:
      drv->restart_adv_on_disconnect = true;
      memcpy(&drv->adv_cmd, &command->data.adv_start, sizeof(drv->adv_cmd));
      if (drv->connected) {
        drv->mode_requested = BLE_MODE_KEEP_CONNECTION;
      } else {
        drv->mode_requested = BLE_MODE_CONNECTABLE;
      }
      result = true;
      break;
    case BLE_PAIRING_MODE:
      drv->restart_adv_on_disconnect = true;
      irq_unlock(key);
      result = ble_start_pairing(command);
      return result;
    case BLE_DISCONNECT:
      if (drv->connected && drv->restart_adv_on_disconnect) {
        drv->next_adv_with_disconnect = true;
      }
      result = ble_send_disconnect(drv);
      break;
    case BLE_ERASE_BONDS:
      result = ble_send_erase_bonds(drv);
      break;
    case BLE_ALLOW_PAIRING:
      result = ble_send_pairing_accept(drv, command->data.pairing_code);
      break;
    case BLE_REJECT_PAIRING:
      result = ble_send_pairing_reject(drv);
      break;
    case BLE_KEEP_CONNECTION:
      drv->restart_adv_on_disconnect = false;
      if (drv->connected) {
        drv->mode_requested = BLE_MODE_KEEP_CONNECTION;
      } else {
        drv->mode_requested = BLE_MODE_OFF;
      }
      break;
    default:
      break;
  }

  irq_unlock(key);

  return result;
}

bool ble_get_event(ble_event_t *event) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  irq_key_t key = irq_lock();

  bool result = tsqueue_dequeue(&drv->event_queue, (uint8_t *)event,
                                sizeof(*event), NULL, NULL);

  irq_unlock(key);

  return result;
}

static void ble_event_flush(void) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return;
  }

  irq_key_t key = irq_lock();

  tsqueue_reset(&drv->event_queue);

  irq_unlock(key);
}

void ble_set_name(const uint8_t *name, size_t len) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return;
  }

  irq_key_t key = irq_lock();

  memset(drv->adv_cmd.name, 0, sizeof(drv->adv_cmd.name));
  memcpy(drv->adv_cmd.name, name, MIN(len, sizeof(drv->adv_cmd.name)));

  if (drv->mode_requested == BLE_MODE_CONNECTABLE) {
    ble_send_advertising_on(drv, true);
  }

  if (drv->mode_requested == BLE_MODE_PAIRING) {
    ble_send_advertising_on(drv, false);
  }

  irq_unlock(key);
}

static bool ble_start_pairing(ble_command_t *command) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    return false;
  }

  uint16_t retry_cnt = 0;
  irq_key_t key;

  bool connected = drv->connected;
  while (connected) {
    retry_cnt++;
    if (retry_cnt > 10) {
      // too many retries, give up
      return false;
    }

    ble_send_disconnect(drv);

    systick_delay_ms(20);  // wait for disconnect to complete

    key = irq_lock();
    connected = drv->connected;
    irq_unlock(key);
  }

  ble_event_flush();

  key = irq_lock();

  memcpy(&drv->adv_cmd, &command->data.adv_start, sizeof(drv->adv_cmd));
  drv->mode_requested = BLE_MODE_PAIRING;

  irq_unlock(key);

  return true;
}

void ble_get_state(ble_state_t *state) {
  const ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    memset(state, 0, sizeof(ble_state_t));
    return;
  }

  irq_key_t key = irq_lock();

  state->connected = drv->connected;
  state->peer_count = drv->peer_count;
  state->pairing = drv->mode_current == BLE_MODE_PAIRING;
  state->connectable = drv->mode_current == BLE_MODE_CONNECTABLE;
  state->pairing_requested = drv->pairing_requested;
  state->state_known = drv->status_valid;
  memcpy(&state->connected_addr, &drv->connected_addr,
         sizeof(drv->connected_addr));

  irq_unlock(key);
}

bool ble_get_mac(bt_le_addr_t *mac) {
  ble_driver_t *drv = &g_ble_driver;

  if (!drv->initialized) {
    memset(mac, 0, sizeof(*mac));
    return false;
  }

  drv->mac_ready = false;

  if (!ble_send_mac_request(drv)) {
    return false;
  }

  uint32_t timeout = ticks_timeout(100);

  while (!ticks_expired(timeout)) {
    irq_key_t key = irq_lock();
    if (drv->mac_ready) {
      memcpy(mac, &drv->mac, sizeof(drv->mac));
      irq_unlock(key);
      return true;
    }
    irq_unlock(key);
  }

  memset(mac, 0, sizeof(*mac));
  return false;
}

uint8_t ble_get_bond_list(bt_le_addr_t *bonds, size_t count) {
  ble_driver_t *drv = &g_ble_driver;

